import React from "react";
import "./About.css";

function About() {
  return (
    <div className="team-page">
      <h1></h1>

      {/* تعريف المركز */}
      <section className="intro-section">
        <h2> تعريف مركز العلم والعمل</h2>
        <p>
           هو مركز تعليمي تدريبي استشاري دولي يعمل في مجلات البناء الإنساني
          والتزكية والتعليم والمعرفة، شعاره <strong>علم نافع عمل رافع</strong>.
        </p>
        <p>
          تستهدف أنشطة المركز كل فئات المجتمع، وخصوصا الآباء والأمهات،
          والمعلمين والمعلمات، مع تركيز أكبر على الأطفال وما يتعلق بهم.
        </p>
        <p>
           يركز المركز على البناء المنهاجي للإنسان وتسديد مفاهيمه وتجويد
          وترشيد مهاراته البنائية المنهاجية في التعامل مع مصادر المعرفة
          المسطورة والمنظورة.
        </p>
      </section>

      {/* Vision & Mission */}
      <section className="about-section">
        <h2> الرؤية</h2>
        <p>
          أن نكون مركزاً رائداً في نشر العلم والعمل، ونساهم في إعداد جيل قادر
          على الجمع بين المعرفة والتطبيق لخدمة المجتمع.
        </p>

        <h2> الرسالة</h2>
        <p>
          توفير بيئة تدريبية متكاملة تجمع بين الجودة، القيم، والابتكار، عبر برامج
          تعليمية وتدريبية متميزة.
        </p>
      </section>

    </div>
  );
}

export default About;
